Revit 2025 API
GridSegmentDirection Enumeration
 Specify one of the four adjacent segments to a GridNode. See DividedSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum GridSegmentDirection
Public Enumeration GridSegmentDirection
public enum class GridSegmentDirection
type GridSegmentDirection
Members
Member name | Value | Description
PositiveU | 0
NegativeU | 1
PositiveV | 2
NegativeV | 3
See Also
Reference
Autodesk.Revit.DB Namespace